import type { NextPage } from 'next'
import styles from '../styles/Home.module.css'
const Home: NextPage = () => {
  return (
    <div>
      <h1 className={styles.title}>
        Intelligent Reciprocal Recycling System
      </h1>
      <p className={styles.content}>
        Η ανακύκλωση εδώ και αρκετά χρόνια αποτελεί σημαντικός παράγοντας για την προστασία του 
        περιβάλλοντος. Έστω και αργά έγινε κατανοητό ότι
        οι πρώτες ύλες θα τελειώσουν και χρειάζεται
        να αναπτυχθούν λύσεις επαναχρησιμοποίησης των “άχρηστων” πια προϊόντων, 
        των συσκευασιών και άλλων υλικών. 
        Η συμμετοχή στην ανακύκλωση πέρα από ηθική υποχρέωση όλων απαιτεί και κόπο 
        και είναι καλή ιδέα να ανταμείβονται όσοι αφιερώνουν χρόνο να ανακυκλώνουν 
        αντικείμενα που είτε χρησιμοποιούν οι ίδιοι είτε όχι. 
        Το σύστημα που σχεδίασε η ομάδα ΕΛΛΑΚ του Γενικού Λυκείου Καλαμπάκας 
        θα δίνει δυνατότητα στους μαθητές να ανακυκλώνουν βασικά 
        υλικά που χρησιμοποιούν στο σχολείο. Θα ταυτοποιείται ο 
        χρήστης με ένα κωδικό με τη χρήση εφαρμογής κινητού 
        τηλεφώνου και στη συνέχεια το σύστημα θα δέχεται το 
        αντικείμενο προς ανακύκλωση. Αφού αναγνωριστεί και 
        τοποθετηθεί στον κατάλληλο κάδο θα προσμετρώνται στον 
        συγκεκριμένο χρήστη πόντοι οι οποίοι θα αντιστοιχούν σε 
        διάφορα δώρα π.χ. από τα βιβλιοπωλεία της πόλης ή το κυλικείο του σχολείου.
      </p>
    </div>
  )
}

export default Home
